
Процедура ОбработкаПроведения(Отказ, Режим)
	
// регистр ДвижениеОсновныхДеталей
	Движения.ДвижениеОсновныхДеталей.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеДетали Из ОсновныеДетали Цикл
		Движение = Движения.ДвижениеОсновныхДеталей.Добавить();
		Движение.Период = Дата;
		Движение.Деталь = ТекСтрокаОсновныеДетали.ДетальПриемНаСкл;
		Движение.Статус = Перечисления.СтатусДетали.НаСкладе;
		Движение.Комментарий = Коментарий;
		Если ИсточникПоступленияНаСклад = Перечисления.СтатусДетали.ВЗапас Или ИсточникПоступленияНаСклад = Перечисления.СтатусДетали.Используется Тогда
			Движение.Исполнитель = Менеджер;
		ИначеЕсли ИсточникПоступленияНаСклад = Перечисления.СтатусДетали.НаРемонте Тогда 
			Движение.Исполнитель = СервисныйПункт;
			Движение.СтоимостьРемонтаОД = ТекСтрокаОсновныеДетали.СтоимостьРемонта;
			Движение.Комментарий = ТекСтрокаОсновныеДетали.Неисправность;
		КонецЕсли;
	КонецЦикла;
		
	Если ИсточникПоступленияНаСклад = Перечисления.СтатусДетали.Используется тогда
		// регистр Используется Расход
		Движения.Используется.Записывать = Истина;
		Для Каждого ТекСтрокаРасходныеДетали Из РасходныеДетали Цикл
			Движение = Движения.Используется.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДетальРасх = ТекСтрокаРасходныеДетали.Деталь;
			Движение.ТерминалРасх = Терминал;
			Движение.КоличествоРасх = ТекСтрокаРасходныеДетали.Количество;
			Движение.ИсполнительРасхИсп = Менеджер;
			Движение.КомментарийРасхИсп = Коментарий;
		КонецЦикла;
	ИначеЕсли ИсточникПоступленияНаСклад = Перечисления.СтатусДетали.ВЗапас тогда
		// регистр ВЗапас Расход
		Движения.ВЗапас.Записывать = Истина;
		Для Каждого ТекСтрокаРасходныеДетали Из РасходныеДетали Цикл
			Движение = Движения.ВЗапас.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДетальРасхЗапас = ТекСтрокаРасходныеДетали.Деталь;
			Движение.МенеджерРасхЗапас = Менеджер;
			Движение.КоличествоРасхЗапас = ТекСтрокаРасходныеДетали.Количество;
			Движение.ИсполнительРасхЗапас = Менеджер;
			Движение.КомментарийРасхЗапас = Коментарий;
		КонецЦикла;
	ИначеЕсли ИсточникПоступленияНаСклад = Перечисления.СтатусДетали.НаРемонте тогда
		// регистр НаРемонт Расход
		Движения.НаРемонт.Записывать = Истина;
		Для Каждого ТекСтрокаРасходныеДетали Из РасходныеДетали Цикл
			Движение = Движения.НаРемонт.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДетальРасхНаРем = ТекСтрокаРасходныеДетали.Деталь;
			Движение.СервисныйПунктРасх = СервисныйПункт;
			Движение.КоличествоРасхНаСклад = ТекСтрокаРасходныеДетали.Количество;
			Движение.ИсполнительРасхНаСклад = СервисныйПункт;
			Движение.КомментарийРасхНаСклад = Коментарий;
			Движение.Цена = ТекСтрокаРасходныеДетали.Цена;
			Движение.Сумма = ТекСтрокаРасходныеДетали.Сумма;
		КонецЦикла;
	КонецЕсли;	
	
	// регистр НаСклад Приход
	Движения.НаСклад.Записывать = Истина;
	Для Каждого ТекСтрокаРасходныеДетали Из РасходныеДетали Цикл
		Движение = Движения.НаСклад.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДетальРасхНаСклад = ТекСтрокаРасходныеДетали.Деталь;
		Движение.КоличествоРасхНаСклад = ТекСтрокаРасходныеДетали.Количество;
		Движение.Цена = ТекСтрокаРасходныеДетали.Цена;
		Движение.Сумма = ТекСтрокаРасходныеДетали.Сумма;
		Движение.КомментарийРасхНаСклад = Коментарий;
	КонецЦикла;

		
	
	// регистр РемонтОсновныхДеталей
	Движения.РемонтОсновныхДеталей.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеДетали1 Из ОсновныеДетали Цикл
		Движение = Движения.РемонтОсновныхДеталей.Добавить();
		Движение.Статус  = Перечисления.СтатусДетали.НаСкладе;
		Движение.Период = Дата;
		Движение.ОсновнаяДеталь = ТекСтрокаОсновныеДетали1.ДетальПриемНаСкл;
		Движение.СервисныйПункт = СервисныйПункт;
		Движение.СтоимостьРемонта = ТекСтрокаОсновныеДетали1.СтоимостьРемонта;
	КонецЦикла;
	

КонецПроцедуры
