
#Область ПроцедурыФормы

	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		Объект.Дата = ТекущаяДата();
		ПроверкаТерминалаИПрисваиваниеМетки();	
	КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура ПроверкаТерминалаИПрисваиваниеМетки()
		Если Не Объект.ТекущееНазваниеТерминала.Пустая() Тогда
			пр1 = ПолучитьТД(Объект.ТекущееНазваниеТерминала,Объект.Дата);
			если пр1.Эксплуатация = ложь тогда
				Объект.ТекущееНазваниеТерминала = null;
		 		Сообщить("Данный терминал еще не эксплуатируется");
			иначе
				ПрисвоитьМетку();
			КонецЕсли;
		КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура ПеремОткПриИзменении(Элемент)
		ПроверкаТерминалаИПрисваиваниеМетки();
	КонецПроцедуры

	&НаКлиенте
	Процедура ПрисвоитьМетку();
		Объект.Откуда = Объект.ТекущееНазваниеТерминала; 	
		Данные = ПолучитьТД(Объект.ТекущееНазваниеТерминала,Объект.Дата);
		ОтКого = Данные.Принял;
	КонецПроцедуры

	&НаКлиенте
	Процедура ДоговорАрендыПеремПриИзменении(Элемент)
		Объект.ПеремКуда = получитьАдресАренды(Объект.ДоговорАрендыПерем);
	КонецПроцедуры

	&НаКлиенте
	Процедура ДоговорАрендыПеремНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьПереченьДействующихДоговоров(Объект.Дата);
	КонецПроцедуры

#КонецОбласти

#Область НеобходимоПеренести

	&НаСервере
	Функция ПолучитьТД(Терминал, Дата)
		Отбор = Новый Структура;
		Отбор.Вставить("Терминал",Терминал);
		Данные = РегистрыСведений.ДвижениеТерминалов.ПолучитьПоследнее(Дата,Отбор);
		Возврат Данные;
	КонецФункции

	&НаСервере
	Функция получитьАдресАренды(СсылкаНаДоговор)
		Возврат СсылкаНаДоговор.ПолучитьОбъект().АдресУстановки;
	КонецФункции

	&НаСервере
	Функция ПолучитьПереченьДействующихДоговоров(Дата);
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ДействующиеДоговораСрезПоследних.Договор КАК Договор
		|ИЗ
		|	РегистрСведений.ДействующиеДоговора.СрезПоследних КАК ДействующиеДоговораСрезПоследних
		|ГДЕ
		|	ДействующиеДоговораСрезПоследних.Период <= &Дата");
		Запрос.УстановитьПараметр("Дата", Дата);
		Список = Новый СписокЗначений;
		МассивЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");
		Для Каждого Значение Из МассивЗначений Цикл
			Список.Добавить(Значение, Значение.Номер+", "+Значение.Дата+", Адрес: "+Значение.АдресУстановки);
		КонецЦикла;                           
		Возврат Список;
	КонецФункции

#КонецОбласти