
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДвижениеОсновныхДеталей
	Движения.ДвижениеОсновныхДеталей.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеДетали Из ОсновныеДетали Цикл
		Движение = Движения.ДвижениеОсновныхДеталей.Добавить();
		Движение.Период = Дата;
		Движение.Деталь = ТекСтрокаОсновныеДетали.ДетальПриемНаСкл;
		Движение.Статус = Перечисления.СтатусДетали.НаРемонте;
		Движение.Комментарий = ТекСтрокаОсновныеДетали.КомментарийТЧ;
		//Если ИсточникПоступленияНаСклад = Перечисления.СтатусДетали.ВЗапас Или ИсточникПоступленияНаСклад = Перечисления.СтатусДетали.Используется Тогда
		//	Движение.Исполнитель = Менеджер;
		//ИначеЕсли ИсточникПоступленияНаСклад = Перечисления.СтатусДетали.НаРемонте Тогда 
		Движение.СервисТочка = СервисныйПункт;
		//КонецЕсли;
		//ОбъектДеталь = ТекСтрокаОсновныеДетали.ДетальПриемНаСкл.ПолучитьОбъект();
		//ОбъектДеталь.ПометкаУдаления = Истина;
		//ОбъектДеталь.Записать();
	КонецЦикла;


	
	// регистр Неисправно Расход
	Движения.Неисправно.Записывать = Истина;
	Для Каждого ТекСтрокаРасходныеДетали Из РасходныеДетали Цикл
		Движение = Движения.Неисправно.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ДетальРасхНаРем = ТекСтрокаРасходныеДетали.ДетальНаРемРасх;
		Движение.КоличествоРасхНаСклад = ТекСтрокаРасходныеДетали.КоличествоНаРемРасх;
		Движение.ИсполнительРасхНаСклад = СервисныйПункт;
		Движение.КомментарийРасхНаСклад = ТекСтрокаРасходныеДетали.КомментарийНаремРасх;
	КонецЦикла;

	// регистр НаРемонт Приход
	Движения.НаРемонт.Записывать = Истина;
	Для Каждого ТекСтрокаРасходныеДетали Из РасходныеДетали Цикл
		Движение = Движения.НаРемонт.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДетальРасхНаРем = ТекСтрокаРасходныеДетали.ДетальНаРемРасх;
		Движение.СервисныйПунктРасх = СервисныйПункт;
		Движение.КоличествоРасхНаСклад = ТекСтрокаРасходныеДетали.КоличествоНаРемРасх;
		Движение.КомментарийРасхНаСклад = ТекСтрокаРасходныеДетали.КомментарийНаремРасх;
	КонецЦикла;

	// регистр РемонтОсновныхДеталей
	Движения.РемонтОсновныхДеталей.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеДетали1 Из ОсновныеДетали Цикл
		Движение = Движения.РемонтОсновныхДеталей.Добавить();
		Движение.Период =Дата;
		Движение.ОсновнаяДеталь = ТекСтрокаОсновныеДетали1.ДетальПриемНаСкл;
		Движение.СервисныйПункт = СервисныйПункт;
		Движение.Неисправность = ТекСтрокаОсновныеДетали1.КомментарийТЧ;
		Движение.Статус = Перечисления.СтатусДетали.НаРемонте;
	КонецЦикла;


	
КонецПроцедуры
