//Процедуры обработки событий формы
#Область ПроцедурыФормы

	// Процедура - Подготовки формы при её открытии
	//
	// Параметры:
	//  Отказ	 - Булево	 - Индикатор определяющий будет ли открыта форма
	//
	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		ПриОткрытииНаСервере();
		ПроверитьТерминал();
	КонецПроцедуры

	
	// Процедура - Получение необходимых данных с сервера для открытия формы
//
	&НаСервере
	Процедура ПриОткрытииНаСервере()
		Объект.Дата = ТекущаяДата();
	КонецПроцедуры

#КонецОбласти

//Процедуры обработки событий реквизитов формы
#Область КомандыДляКнопок
	
	//ПЕЧАТЬ ДОКУМЕНТА
	&НаСервере
	Процедура КнопкаПечатьНаСервере()
		//ТаблДок = новый ТабличныйДокумент;
		//Макет = ПолучитьМакетОформления("ПечатьВводВЭксплуатацию");
		//ТаблДок.Вывести();
		//ТаблДок.Показать("Ввод в эксплуатацию терминала"+Объект.ТекущееНазваниеТерминала)
	КонецПроцедуры

	&НаКлиенте
	Процедура КнопкаПечать(Команда)
		КнопкаПечатьНаСервере();
	КонецПроцедуры
	
#КонецОбласти

#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура ПеремОткПриИзменении(Элемент)
		ПроверитьТерминал();
	КонецПроцедуры

	&НаКлиенте
	Процедура ПроверитьТерминал()
		Если ЗначениеЗаполнено(Объект.ТекущееНазваниеТерминала) Тогда
			пр = ПолучитьТД(Объект.ТекущееНазваниеТерминала,Объект.Дата);
			если пр.Эксплуатация тогда                         
				Объект.ТекущееНазваниеТерминала = null;
		 		Сообщить("Данный терминал уже эксплуатируется")
			КонецЕсли;
		КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура ДоговорАрендыВводНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = ПолучитьПереченьДействующихДоговоров(Объект.Дата);
	КонецПроцедуры

#КонецОбласти

#Область НеобходимоПеренести
	
	// Функция - Получения последних данных по выбранному терминалу
	//
	// Параметры:
	//  Терминал - СправочникСсылка.Терминалы	 - Терминал по которому необходимо получить данные
	//  Дата	 - Дата	 - Дата на которую данные должны быть актуальны
	// 
	// Возвращаемое значение:
	//  Структура - Данные из регистра сведений движение терминалов
	//
	&НаСервере
	Функция ПолучитьТД(Терминал, Дата)
		Отбор = Новый Структура;
		Отбор.Вставить("Терминал",Терминал);
		Данные = РегистрыСведений.ДвижениеТерминалов.ПолучитьПоследнее(Дата,Отбор);
		Возврат Данные;
	КонецФункции

	// Функция - Получения переченя действующих договоров на определенную дату
	//
	// Параметры:
	//  Дата - Дата	 - Время на которое нужно получить действующие договора
	// 
	// Возвращаемое значение:
	//  СписокЗначений - Список действующих договоров
	//
	&НаСервере
	Функция ПолучитьПереченьДействующихДоговоров(Дата);
		Запрос = Новый Запрос("ВЫБРАТЬ
	    |	ДействующиеДоговораСрезПоследних.Договор КАК Договор
	    |ИЗ
	    |	РегистрСведений.ДействующиеДоговора.СрезПоследних КАК ДействующиеДоговораСрезПоследних
	    |ГДЕ
	    |	ДействующиеДоговораСрезПоследних.Период <= &Дата");
		Запрос.УстановитьПараметр("Дата", Дата);
		Список = Новый СписокЗначений;
		МассивЗначений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Договор");
		Для Каждого Значение Из МассивЗначений Цикл
			Список.Добавить(Значение, Значение.Номер+", "+Значение.Дата+", Адрес: "+Значение.АдресУстановки);
		КонецЦикла;                           
		Возврат Список;
	КонецФункции

#КонецОбласти
