
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДвижениеТерминалов
	Движения.ДвижениеТерминалов.Записывать = Истина;
	Движение = Движения.ДвижениеТерминалов.Добавить();
	Движение.Период = Дата;
	Движение.Терминал = ТекущееНазваниеТерминала;
	Движение.ДоговорАрендРегистр = ДоговорАрендыПерем;
	Движение.Откуда = Откуда;
	Движение.Куда = ПеремКуда;
	Движение.Метка = НоваяМетка;
	Движение.Принял = НоваяМетка.Менеджер;
	СтараяМетка = ФункцииТерминалов.ПолучитьМетку(Движение.Терминал, Дата);
	Движение.Эксплуатация = Истина;
	Движение.Организация = ДоговорАрендыПерем.Контрагент;
	Движение.Комментарий = Комментарий;
		
	Движение.ОтКого = СтараяМетка.Менеджер;
	 Если ПеремКуда <> "" тогда
	Терм = Справочники.Терминалы.НайтиПоНаименованию(ТекущееНазваниеТерминала);
	Терм2=Терм.ПолучитьОбъект();
	Терм2.Наименование = ПеремКуда;
	Терм2.Записать();
	КонецЕсли;
	
	Движения.ДвижениеТерминалов.Записывать = Истина;
	Движение = Движения.СведенияОДоговорАренды.Добавить();
	Движение.Период = Дата;
	Движение.Договор = ДоговорАрендыПерем;
	Движение.ДействуетПоРегистр = ДоговорАрендыПерем.Действует;
	Движение.Контрагент = ДоговорАрендыПерем.Контрагент;
	Движение.СтоимостьАрендыРегистр = ДоговорАрендыПерем.Стоимость;
	Движение.ТерминалАрендаРегистр = ТекущееНазваниеТерминала;

	//регистр СвязиТерминаловИДоговоров
	Движения.СведенияОДоговорАренды.Записывать = Истина;
	Движение = Движения.СвязиТерминаловИДоговоров.Добавить();
	Движение.Период = Дата;
	Движение.Терминал = ТекущееНазваниеТерминала;
	Движение.ДействущийДоговор = ДоговорАрендыПерем;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Терминалы") Тогда
		// Заполнение шапки
		Откуда = ДанныеЗаполнения.Наименование;
		ТекущееНазваниеТерминала = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

