#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура НаименованиеПриИзменении(Элемент)
			
		Если ПустаяСтрока(Объект.ПолноеНазваниеКонтр) Тогда
			Если Врег(Лев(Объект.Наименование,4)) = "ООО " Тогда
				Объект.ПолноеНазваниеКонтр = "Общество с ограниченной ответственностью" +" " +Сред(Объект.Наименование,5);
			Иначе
				Объект.ПолноеНазваниеКонтр = Объект.Наименование;
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры

	&НаКлиенте
	Процедура АдресЮрПриИзменении(Элемент)
		Объект.АдресФакт = Объект.АдресЮр;
	КонецПроцедуры

#КонецОбласти

#Область НеобходимоПеренести

	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

		
	КонецПроцедуры

#КонецОбласти