#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура НаименованиеПриИзменении(Элемент)
			
		Если ПустаяСтрока(Объект.ПолноеНазваниеКонтр) Тогда
			Если Врег(Лев(Объект.Наименование,4)) = "ООО " Тогда
				Объект.ПолноеНазваниеКонтр = "Общество с ограниченной ответственностью" +" " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ОАО " Тогда
				Объект.ПолноеНазваниеКонтр = "Открытое акционерное общество " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ЗАО " Тогда
				Объект.ПолноеНазваниеКонтр = "Закрытое акционерное общество " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ПАО " Тогда
				Объект.ПолноеНазваниеКонтр = "Публичное акционерное общество " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "АО " Тогда
				Объект.ПолноеНазваниеКонтр = "Акционерное Общество " +Сред(Объект.Наименование,5);
				
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ЧАО " Тогда
				Объект.ПолноеНазваниеКонтр = "Частное акционерное общество " +Сред(Объект.Наименование,5);
	
			ИначеЕсли Врег(Лев(Объект.Наименование,4)) = "ИП " Тогда
				Объект.ПолноеНазваниеКонтр = "Индивидуальный предприниматель " +Сред(Объект.Наименование,5);	
			
			Иначе
				Объект.ПолноеНазваниеКонтр = Объект.Наименование;
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры

	&НаКлиенте
	Процедура АдресЮрПриИзменении(Элемент)
		Объект.АдресФакт = Объект.АдресЮр;
	КонецПроцедуры
	
#КонецОбласти

#Область НеобходимоПеренести

	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

		
	КонецПроцедуры

#КонецОбласти