Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	   КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "ЛистПервичнойОценки";
    КомандаПечати.Представление = НСтр("ru = 'ЛистПервичнойОценки'");
    КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
    КомандаПечати.СписокФорм    = "ФормаДокумента";
КонецПроцедуры

Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПервоеПеремещениеТерминала.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервоеПеремещениеТерминала.ДоговорАрендыВвод,
	|	ПервоеПеремещениеТерминала.КомментарийПеремТермин,
	|	ПервоеПеремещениеТерминала.Метка,
	|	ПервоеПеремещениеТерминала.ТекущееНазваниеТерминала
	|ИЗ
	|	Документ.ПервоеПеремещениеТерминала КАК ПервоеПеремещениеТерминала
	|ГДЕ
	|	ПервоеПеремещениеТерминала.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Процедура ПечатьСписка(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСписка)
	Макет = Документы.ПервоеПеремещениеТерминала.ПолучитьМакет("ПечатьСписка");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПервоеПеремещениеТерминала.Дата,
	|	ПервоеПеремещениеТерминала.ДоговорАрендыВвод,
	|	ПервоеПеремещениеТерминала.КомментарийПеремТермин,
	|	ПервоеПеремещениеТерминала.Метка,
	|	ПервоеПеремещениеТерминала.Номер,
	|	ПервоеПеремещениеТерминала.ТекущееНазваниеТерминала
	|ИЗ
	|	Документ.ПервоеПеремещениеТерминала КАК ПервоеПеремещениеТерминала
	|ГДЕ
	|	ПервоеПеремещениеТерминала.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
