
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДвижениеТерминалов
	Движения.ДвижениеТерминалов.Записывать = Истина;
	Движение = Движения.ДвижениеТерминалов.Добавить();
	Движение.Период = Дата;
	Движение.Терминал = ТекущееНазваниеТерминала;
	Движение.ДоговорАрендРегистр = ДоговорАрендыВвод;
	Движение.Откуда = "Впервые введен";
	Движение.Куда = ТекущееНазваниеТерминала;
	Движение.Принял = Метка.Менеджер;
	Движение.Метка = Метка;
	Движение.ОтКого = "Впервые введен";
	Движение.Эксплуатация = Истина;
	Движение.Организация = ДоговорАрендыВвод.Контрагент;
	Движение.Комментарий = КомментарийПеремТермин;
	СТ = ТекущееНазваниеТерминала.ПолучитьОбъект();
	СТ.Наименование = ДоговорАрендыВвод.АдресУстановки;
	СТ.Записать();

	// регистр СведенияОДоговорАренды
	Движения.СведенияОДоговорАренды.Записывать = Истина;
	Движение = Движения.СведенияОДоговорАренды.Добавить();
	Движение.Период = Дата;
	Движение.Договор = ДоговорАрендыВвод;
	Движение.ДействуетПоРегистр = ДоговорАрендыВвод.Действует;
	Движение.Контрагент = ДоговорАрендыВвод.Контрагент;
	Движение.СтоимостьАрендыРегистр = ДоговорАрендыВвод.Стоимость;
	Движение.ТерминалАрендаРегистр = ТекущееНазваниеТерминала;
	
	//Регистр СвязиТерминаловИДоговоров
	Движения.СвязиТерминаловИДоговоров.Записывать = Истина;
	Движение = Движения.СвязиТерминаловИДоговоров.Добавить();
	Движение.Период = Дата;
	Движение.Терминал = ТекущееНазваниеТерминала;
	Движение.ДействущийДоговор = ДоговорАрендыВвод;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Терминалы") Тогда
		// Заполнение шапки
		ТекущееНазваниеТерминала = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

//&НаСервере
//Функция ПолучитьМетку(Терминал, Дата)
//	
//	Отбор = Новый Структура;
//	Отбор.Вставить("Терминал",Терминал);
//    Данные = РегистрыСведений.ДвижениеТерминалов.ПолучитьПоследнее(Дата,Отбор);
//	Возврат Данные.Метка;
//КонецФункции