

&НаСервере
Процедура Печать1(Команда)
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	   
КонецПроцедуры

&НаКлиенте
Процедура НовыеТерминалыТерминалПриИзменении(Элемент)
	ТД = Элементы.НовыеТерминалы.ТекущиеДанные;
	ТД.Цена = ФункцияПолучитьЦену.ПолучитьЦенуНоменклатуры(Объект.Дата,ТД.НовыйТерминал);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Объект.Дата = ТекущаяДатаСеанса();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
