
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ДвижениеТерминалов
	Движения.ДвижениеТерминалов.Записывать = Истина;
	Движение = Движения.ДвижениеТерминалов.Добавить();
	Движение.Период = Дата;
	Движение.Терминал = ТекущееНазваниеТерминала;
	Движение.Откуда = Откуда;
	Движение.Куда = "Списан, "+ТекущееНазваниеТерминала.Наименование;
	Движение.Принял = "Утилизация";
	Движение.Эксплуатация = Ложь;
	Движение.Комментарий = КомментарийСписаниеТермин;
	
	Спис = ТекущееНазваниеТерминала.ПолучитьОбъект();
	Спис.Наименование = "Списан, "+ТекущееНазваниеТерминала.Наименование; 
	Спис.ПометкаУдаления = Истина;
	Спис.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Терминалы") Тогда
		// Заполнение шапки
		ПеремКуда = ДанныеЗаполнения.Наименование;
		ТекущееНазваниеТерминала = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

//&НаСервере
//Функция ПолучитьМетку(Терминал, Дата)
//	
//	Отбор = Новый Структура;
//	Отбор.Вставить("Терминал",Терминал);
//    Данные = РегистрыСведений.ДвижениеТерминалов.ПолучитьПоследнее(Дата,Отбор);
//	Возврат Данные.Метка;
//КонецФункции