#Область ПроцедурыФормы

	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		Объект.Дата = ТекущаяДата();
		Если не Объект.НомерПисьменногоДоговора = "" тогда
			Элементы.НомерПисьменногоДоговора.Видимость = истина;
		КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		Если Элементы.НомерПисьменногоДоговора.Видимость = истина и Объект.НомерПисьменногоДоговора = "" тогда
			Отказ = истина;
			Сообщить("Введите № письменного договора аренды");
		Иначе
			Отказ = ложь;
		КонецЕсли;
	КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	Процедура КонтрагентПриИзменении(Элемент)
		Объект.ВЛице = КонтрагентПриИзмененииНаСервере(Объект.Контрагент);
	КонецПроцедуры
	
	&НаКлиенте
	Процедура ФормаДоговораПриИзменении(Элемент)
		ФД =Объект.ФормаДоговора;
		Если ФД = ПолучитьПеречисление() тогда
			Элементы.НомерПисьменногоДоговора.Видимость = истина;
		КонецЕсли;
	КонецПроцедуры

#КонецОбласти

#Область НеобходимоПеренести

&НаСервере
Функция КонтрагентПриИзмененииНаСервере(Контрагент)
	Возврат Контрагент.РуководительКонтр;
КонецФункции

//ПеречислениеПисьменнаяФорма
&НаСервере
Функция ПолучитьПеречисление()
	возврат Перечисления.ФормаДоговора.ПисьменнаяФорма;
КонецФункции

#КонецОбласти