
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрОплатаАренды
	Движения.РегистрОплатаАренды.Записывать = Истина;
	Движение = Движения.РегистрОплатаАренды.Добавить();
	Движение.Период = Дата;
	Движение.Договор = Договор;
	Движение.ДатаРегОпл = Дата;
	Движение.СтоимостьАрендыРег = Договор.Стоимость;
	Движение.ПроплаченныйМесяц = ЗаМесяц;
	Движение.ОплатаАрендыРег = СуммаОплаты;
	Движение.РайонРег = Договор.Район;
	//Движение.Терминал = Адрес;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
