#Область ПроцедурыФормы

	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		Объект.Дата = ТекущаяДата();
		ПроверкаТерминалаиЗаполнениеДанных();
	КонецПроцедуры

#КонецОбласти

#Область ПроцедурыРеквизитовФормы

	&НаКлиенте
	процедура ПроверкаТерминалаиЗаполнениеДанных()
			Если Не Объект.ТекущееНазваниеТерминала.Пустая() тогда
				Данные = ПолучитьТД(Объект.ТекущееНазваниеТерминала,Объект.Дата);
				Если Данные.Эксплуатация = ложь тогда
					Объект.ТекущееНазваниеТерминала = null;
					Сообщить("Данный терминал еще не эксплуатируется");
				иначе
					Объект.Откуда = Объект.ТекущееНазваниеТерминала; 	
		        	ОтКого = Данные.Принял;
				КонецЕсли;
			КонецЕсли;
	КонецПроцедуры

	&НаКлиенте
	Процедура ПеремОткПриИзменении(Элемент)
	 	ПроверкаТерминалаиЗаполнениеДанных();
	КонецПроцедуры

#КонецОбласти

#Область НеобходимоПеренести

&НаСервере
Функция ПолучитьТД(Терминал, Дата)
	Отбор = Новый Структура;
	Отбор.Вставить("Терминал",Терминал);
    Данные = РегистрыСведений.ДвижениеТерминалов.ПолучитьПоследнее(Дата,Отбор);
	Возврат Данные;
КонецФункции

#КонецОбласти