
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ПокупкаТерминала
	Движения.ПокупкаТерминала.Записывать = Истина;
	Для Каждого ТекСтрокаНовыеТерминалы Из НовыеТерминалы Цикл
			
		НовыйОснЭлемент = Справочники.Терминалы.СоздатьЭлемент();
		//Заполняем его реквизиты
		//НовыйОснЭлемент.Родитель = Группа.Ссылка;
		НовыйОснЭлемент.СерийныйНомерТермин =ТекСтрокаНовыеТерминалы.СерийныйНомер;
		//НовыйОснЭлемент.Комплектующее = ТекСтрокаОсновныеДетали.Деталь;
		НовыйОснЭлемент.Наименование = "НОВЫЙ "+ТекСтрокаНовыеТерминалы.НовыйТерминал.Наименование;
		//Сохраняем результат
		НовыйОснЭлемент.Записать();

		
		Движение = Движения.ПокупкаТерминала.Добавить();
		Движение.Период = Дата;
		Движение.НовыйТерминал = ТекСтрокаНовыеТерминалы.НовыйТерминал;
		Движение.СерийныйНомер = ТекСтрокаНовыеТерминалы.СерийныйНомер;
		Движение.Цена = ТекСтрокаНовыеТерминалы.Цена;
	
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры


функция ПолучитьМакетДокумента()
	ПолучитьМакет("Макет");
КонецФункции