
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		// Заполнение шапки
		ВЛице = ДанныеЗаполнения.РуководительКонтр;
		Контрагент = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СведенияОДоговорАренды
	Движения.СведенияОДоговорАренды.Записывать = Истина;
	Движение = Движения.СведенияОДоговорАренды.Добавить();
	Движение.Период = Дата;
	Движение.Договор = Ссылка;
	Движение.ДействуетПоРегистр = Действует;
	Движение.СтоимостьАрендыРегистр = Стоимость;
	Движение.Контрагент = Контрагент;
	Движение.ФормаДоговора = ФормаДоговора;
	
	//регистр ДействующиеДоговора
	Движения.ДействующиеДоговора.Записывать = Истина;
	Движение = Движения.ДействующиеДоговора.Добавить();
	Движение.Период = Дата;
	Движение.Договор = Ссылка;
КонецПроцедуры
