
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродажаТерминалов
	Движения.ПродажаТерминалов.Записывать = Истина;
	Для Каждого ТекСтрокаТерминалыПродажа Из ТерминалыПродажа Цикл
		Движение = Движения.ПродажаТерминалов.Добавить();
		Движение.Период = Дата;
		Движение.УстановленныйТерминал = ТекСтрокаТерминалыПродажа.Терминал;
		Движение.СерийныйНомер = ТекСтрокаТерминалыПродажа.Терминал.СерийныйНомерТермин;
		Движение.Цена = ТекСтрокаТерминалыПродажа.Цена;
		
	Спис = ТекСтрокаТерминалыПродажа.Терминал.ПолучитьОбъект();
	Спис.Наименование = "ПРОДАН, "+ТекСтрокаТерминалыПродажа.Терминал.Наименование; 
	Спис.ПометкаУдаления = Истина;
	Спис.Записать();
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
