
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДвижениеОсновныхДеталей
	Движения.ДвижениеОсновныхДеталей.Записывать = Истина;
	Для Каждого ТекСтрокаОсновныеДетали Из ОсновныеДетали Цикл
		Движение = Движения.ДвижениеОсновныхДеталей.Добавить();
		Движение.Период = Дата;
		Движение.Деталь = ТекСтрокаОсновныеДетали.ДетальУстанВТермин;
		Движение.Статус = Перечисления.СтатусДетали.Используется;
		Движение.Терминал = НовыйТерминУстан;
		Движение.Исполнитель = Менеджер;
		Движение.Комментарий = Комментарий;
	КонецЦикла;
	
	Если ИсточникПоступленияВТермин = Перечисления.СтатусДетали.ВЗапас тогда
	// регистр ВЗапас Расход
		Движения.ВЗапас.Записывать = Истина;
		Для Каждого ТекСтрокаРасходныеДетали Из РасходныеДетали Цикл
			Движение = Движения.ВЗапас.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДетальРасхЗапас = ТекСтрокаРасходныеДетали.ДетальРасхВТермин;
			Движение.МенеджерРасхЗапас = Менеджер;
			Движение.КоличествоРасхЗапас = ТекСтрокаРасходныеДетали.КоличествоРасхВТермин;
			Движение.ИсполнительРасхЗапас = Менеджер;
			Движение.КомментарийРасхЗапас = Комментарий;
		КонецЦикла;

	ИначеЕсли ИсточникПоступленияВТермин = Перечисления.СтатусДетали.НаСкладе тогда
	// регистр НаСклад Расход
		Движения.НаСклад.Записывать = Истина;
		Для Каждого ТекСтрокаРасходныеДетали Из РасходныеДетали Цикл
			Движение = Движения.НаСклад.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ДетальРасхНаСклад = ТекСтрокаРасходныеДетали.ДетальРасхВТермин;
			Движение.КоличествоРасхНаСклад = ТекСтрокаРасходныеДетали.КоличествоРасхВТермин;
			Движение.ИсполнительРасхНаСклад = Менеджер;
			Движение.КомментарийРасхНаСклад = Комментарий;
		КонецЦикла;
	 КонецЕсли;
	
	// регистр Используется Приход
	Движения.Используется.Записывать = Истина;
	Для Каждого ТекСтрокаРасходныеДетали Из РасходныеДетали Цикл
		Движение = Движения.Используется.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ДетальРасх = ТекСтрокаРасходныеДетали.ДетальРасхВТермин;
		Движение.ТерминалРасх = НовыйТерминУстан;
		Движение.КоличествоРасх = ТекСтрокаРасходныеДетали.КоличествоРасхВТермин;
		Движение.ИсполнительРасхИсп = Менеджер;
		Движение.КомментарийРасхИсп = Комментарий;
	КонецЦикла;


	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
