
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПрибыльСТерминРег
	Движения.ПрибыльСТерминРег.Записывать = Истина;
	Для Каждого ТекСтрокаДоходыСТерминалов Из ДоходыСТерминалов Цикл
		Движение = Движения.ПрибыльСТерминРег.Добавить();
		Движение.Период = Дата;
		Движение.ТерминалПрибыльРег = ТекСтрокаДоходыСТерминалов.Терминал;
		Движение.ОборотТерминРег = ТекСтрокаДоходыСТерминалов.Оборот;
		Движение.ДоходТерминРег = ТекСтрокаДоходыСТерминалов.Доход;
		Движение.АрендаТерминРег = ТекСтрокаДоходыСТерминалов.Аренда;
		Движение.ИтогТерминАренд = ТекСтрокаДоходыСТерминалов.СуммаДохода;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
